[
    {
        "id": "4dfb3994b8c64554a0ff1e5bc6b411f7",
        "word": "cinema",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsɪnəmə/",
            "us": "/ˈsɪnəmə/"
        },
        "nearby": [
            {
                "word": "cine",
                "pos": "adjective"
            },
            {
                "word": "cineaste",
                "pos": "noun"
            },
            {
                "word": "cinema",
                "pos": "noun"
            },
            {
                "word": "cinemagoer",
                "pos": "noun"
            },
            {
                "word": "CinemaScope",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "the local cinema",
                        "vi": "rạp chiếu phim địa phương"
                    },
                    {
                        "en": "in a cinema The film has just opened in cinemas across the UK.",
                        "vi": "trong một rạp chiếu phim Bộ phim vừa được khởi chiếu tại các rạp chiếu phim trên khắp Vương quốc Anh."
                    },
                    {
                        "en": "We were sitting in the cinema, waiting for the film to begin.",
                        "vi": "Chúng tôi đang ngồi trong rạp chiếu phim, chờ bộ phim bắt đầu."
                    },
                    {
                        "en": "at a cinema a screening at a cinema in Leicester Square in London",
                        "vi": "tại một rạp chiếu phim một buổi chiếu tại một rạp chiếu phim ở Quảng trường Leicester ở Luân Đôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "when you go to the cinema or to the movies, you go to a cinema to see a film",
                    "vi": "khi bạn đi xem phim hoặc xem phim, bạn đi đến rạp chiếu phim để xem một bộ phim"
                },
                "examples": [
                    {
                        "en": "I used to go to the cinema every week.",
                        "vi": "Tôi thường đến rạp chiếu phim hàng tuần."
                    },
                    {
                        "en": "How often do you go to the cinema?",
                        "vi": "Bao lâu thì bạn đi xem phim?"
                    },
                    {
                        "en": "at the cinema I haven't seen a film at the cinema for nearly 2 years.",
                        "vi": "ở rạp chiếu phim tôi đã không xem một bộ phim nào ở rạp chiếu phim trong gần 2 năm."
                    },
                    {
                        "en": "Is there anything good on at the cinema at the moment?",
                        "vi": "Có điều gì tốt ở rạp chiếu phim vào lúc này không?"
                    },
                    {
                        "en": "in the cinema I hated it when I saw it in the cinema.",
                        "vi": "trong rạp chiếu phim Tôi ghét nó khi tôi nhìn thấy nó trong rạp chiếu phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "films as an art or an industry",
                    "vi": "phim như một nghệ thuật hay một ngành công nghiệp"
                },
                "examples": [
                    {
                        "en": "one of the great successes of British cinema",
                        "vi": "một trong những thành công lớn của điện ảnh Anh"
                    },
                    {
                        "en": "the most influential film in the history of cinema",
                        "vi": "bộ phim có ảnh hưởng nhất trong lịch sử điện ảnh"
                    },
                    {
                        "en": "He was honoured for his outstanding contribution to cinema.",
                        "vi": "Anh được vinh danh vì đóng góp xuất sắc cho điện ảnh."
                    },
                    {
                        "en": "contemporary/world cinema",
                        "vi": "điện ảnh đương đại / thế giới"
                    },
                    {
                        "en": "mainstream/independent/arthouse/avant-garde cinema",
                        "vi": "rạp chiếu phim chính thống / độc lập / arthouse / tiên phong"
                    },
                    {
                        "en": "She started making films in the last years of silent cinema.",
                        "vi": "Cô bắt đầu đóng phim vào những năm cuối của điện ảnh câm."
                    }
                ]
            }
        ]
    },
    {
        "id": "11e97fd9d49c4ae3bd58268483d58893",
        "word": "hospital",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈhɒspɪtl/",
            "us": "/ˈhɑːspɪtl/"
        },
        "nearby": [
            {
                "word": "hospitable",
                "pos": "adjective"
            },
            {
                "word": "hospitably",
                "pos": "adverb"
            },
            {
                "word": "hospital",
                "pos": "noun"
            },
            {
                "word": "hospital corners",
                "pos": "noun"
            },
            {
                "word": "the Hospital for Sick Children",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building where people who are ill or injured are given medical treatment and care",
                    "vi": "một tòa nhà lớn nơi những người bị bệnh hoặc bị thương được chăm sóc và điều trị y tế"
                },
                "examples": [
                    {
                        "en": "to/into (the) hospital (British English) He had to go to/into hospital for treatment.",
                        "vi": "to / into (the) Hospital (Anh Anh) Anh ấy phải đi đến / vào bệnh viện để điều trị."
                    },
                    {
                        "en": "(North American English) He had to go to/into the hospital for treatment.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Anh ấy phải đến / vào bệnh viện để điều trị."
                    },
                    {
                        "en": "I'm going to the hospital to visit my brother.",
                        "vi": "Tôi sẽ đến bệnh viện để thăm anh trai tôi."
                    },
                    {
                        "en": "to be admitted to/into (the) hospital",
                        "vi": "được đưa vào / vào (bệnh viện)"
                    },
                    {
                        "en": "Arrangements have been made for his admission to (the) hospital.",
                        "vi": "Việc sắp xếp đã được thực hiện để anh ấy nhập viện (bệnh viện)."
                    },
                    {
                        "en": "He's been taken to (the) hospital for tests.",
                        "vi": "Anh ấy đã được đưa đến (bệnh viện) để xét nghiệm."
                    },
                    {
                        "en": "The injured were rushed to (the) hospital in an ambulance.",
                        "vi": "Những người bị thương được nhanh chóng đến (bệnh viện) trên xe cấp cứu."
                    },
                    {
                        "en": "to leave (the) hospital",
                        "vi": "rời khỏi (bệnh viện)"
                    },
                    {
                        "en": "to be discharged/released from (the) hospital",
                        "vi": "được xuất viện / xuất viện"
                    },
                    {
                        "en": "to visit a hospital",
                        "vi": "đến thăm một bệnh viện"
                    },
                    {
                        "en": "in (the) hospital He died in hospital.",
                        "vi": "trong (the) bệnh viện Anh ta chết trong bệnh viện."
                    },
                    {
                        "en": "He was treated in the hospital for burns.",
                        "vi": "Anh ấy đã được điều trị trong bệnh viện vì bỏng."
                    },
                    {
                        "en": "I spent four days in hospital.",
                        "vi": "Tôi đã nằm viện bốn ngày."
                    },
                    {
                        "en": "I was in the hospital for four days.",
                        "vi": "Tôi đã ở bệnh viện bốn ngày."
                    },
                    {
                        "en": "in a hospital She works in a hospital in New York.",
                        "vi": "trong một bệnh viện Cô ấy làm việc trong một bệnh viện ở New York."
                    },
                    {
                        "en": "out of (the) hospital She came out of the hospital this morning.",
                        "vi": "out of (the) bệnh viện Cô ấy đã ra khỏi bệnh viện sáng nay."
                    },
                    {
                        "en": "at a hospital Doctors at the hospital decided to keep her in overnight.",
                        "vi": "tại một bệnh viện Các bác sĩ tại bệnh viện quyết định giữ cô ấy lại qua đêm."
                    },
                    {
                        "en": "a private/local hospital",
                        "vi": "một bệnh viện tư nhân / địa phương"
                    },
                    {
                        "en": "a psychiatric/mental hospital",
                        "vi": "một bệnh viện tâm thần / tâm thần"
                    },
                    {
                        "en": "a children's hospital",
                        "vi": "bệnh viện nhi đồng"
                    },
                    {
                        "en": "The procedure requires a two-to-three-night hospital stay.",
                        "vi": "Quy trình này yêu cầu nằm viện từ hai đến ba đêm."
                    },
                    {
                        "en": "There is an urgent need for more hospital beds.",
                        "vi": "Cần gấp thêm giường bệnh."
                    },
                    {
                        "en": "hospital admissions",
                        "vi": "nhập viện"
                    },
                    {
                        "en": "hospital staff",
                        "vi": "nhân viên bệnh viện"
                    },
                    {
                        "en": "a hospital ward/room",
                        "vi": "một khu / phòng bệnh viện"
                    },
                    {
                        "en": "hospital treatment/care",
                        "vi": "điều trị / chăm sóc tại bệnh viện"
                    }
                ]
            }
        ]
    },
    {
        "id": "280ddd9ca7634e01ade2946d298eaef4",
        "word": "library",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈlaɪbrəri/",
            "us": "/ˈlaɪbreri/"
        },
        "nearby": [
            {
                "word": "librarian",
                "pos": "noun"
            },
            {
                "word": "librarianship",
                "pos": "noun"
            },
            {
                "word": "library",
                "pos": "noun"
            },
            {
                "word": "the Library of Congress",
                "pos": "noun"
            },
            {
                "word": "librettist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which collections of books, newspapers, etc. and sometimes films and recorded music are kept for people to read, study or borrow",
                    "vi": "một tòa nhà trong đó các bộ sưu tập sách, báo, v.v. và đôi khi là phim và nhạc thu âm được lưu giữ để mọi người đọc, nghiên cứu hoặc mượn"
                },
                "examples": [
                    {
                        "en": "a public/university/school library",
                        "vi": "thư viện công cộng / đại học / trường học"
                    },
                    {
                        "en": "a library book",
                        "vi": "một cuốn sách thư viện"
                    },
                    {
                        "en": "a toy library (= for borrowing toys from)",
                        "vi": "thư viện đồ chơi (= để mượn đồ chơi từ)"
                    },
                    {
                        "en": "How often do you go to the library?",
                        "vi": "Bạn đến thư viện thường xuyên như thế nào?"
                    },
                    {
                        "en": "You can borrow it from your local library.",
                        "vi": "Bạn có thể mượn nó từ thư viện địa phương của bạn."
                    },
                    {
                        "en": "I got this very interesting book out of the library.",
                        "vi": "Tôi đã nhận được cuốn sách rất thú vị này từ thư viện."
                    },
                    {
                        "en": "a plan to provide mobile library services in rural environments",
                        "vi": "kế hoạch cung cấp dịch vụ thư viện di động trong môi trường nông thôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a collection of books, newspapers, films, recorded music, etc. held in a library or stored in digital form",
                    "vi": "một bộ sưu tập sách, báo, phim, đĩa nhạc, v.v. được lưu trữ trong thư viện hoặc được lưu trữ dưới dạng kỹ thuật số"
                },
                "examples": [
                    {
                        "en": "a music/photo library",
                        "vi": "một thư viện âm nhạc / ảnh"
                    },
                    {
                        "en": "The Media Centre houses a digital library of radio and television programmes.",
                        "vi": "Trung tâm Truyền thông có một thư viện kỹ thuật số các chương trình phát thanh và truyền hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a large house where most of the books are kept",
                    "vi": "một căn phòng trong một ngôi nhà lớn, nơi hầu hết các cuốn sách được lưu giữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a personal collection of books, music recordings, etc.",
                    "vi": "một bộ sưu tập sách cá nhân, bản ghi âm nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "a new edition to add to your library",
                        "vi": "một ấn bản mới để thêm vào thư viện của bạn"
                    },
                    {
                        "en": "The family possessed an extensive library.",
                        "vi": "Gia đình sở hữu một thư viện rộng lớn."
                    },
                    {
                        "en": "She had built up an impressive library of art books.",
                        "vi": "Cô đã xây dựng một thư viện sách nghệ thuật ấn tượng."
                    },
                    {
                        "en": "a personal library of over 1 000 volumes",
                        "vi": "một thư viện cá nhân với hơn 1000 đầu sách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of books, recordings, etc. produced by the same company and similar in appearance",
                    "vi": "một loạt sách, bản ghi âm, v.v. do cùng một công ty sản xuất và có hình thức giống nhau"
                },
                "examples": [
                    {
                        "en": "a library of children’s classics",
                        "vi": "thư viện kinh điển dành cho trẻ em"
                    }
                ]
            }
        ]
    },
    {
        "id": "7b5120d1c6d54ae28bbea243a2815156",
        "word": "movie theater",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmuːvi θɪətə(r)/",
            "us": "/ˈmuːvi θiːətər/"
        },
        "nearby": [
            {
                "word": "movie rating",
                "pos": ""
            },
            {
                "word": "movie star",
                "pos": "noun"
            },
            {
                "word": "movie theater",
                "pos": "noun"
            },
            {
                "word": "moving",
                "pos": "adjective"
            },
            {
                "word": "movingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "The documentary opens tomorrow in movie theaters nationwide.",
                        "vi": "Phim tài liệu khởi chiếu vào ngày mai tại các rạp trên toàn quốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "6895292652e441d98c4767b4891ac8b0",
        "word": "museum",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/mjuˈziːəm/",
            "us": "/mjuˈziːəm/"
        },
        "nearby": [
            {
                "word": "muse",
                "pos": "noun"
            },
            {
                "word": "muse",
                "pos": "verb"
            },
            {
                "word": "museum",
                "pos": "noun"
            },
            {
                "word": "the Museum of Childhood",
                "pos": ""
            },
            {
                "word": "the Museum of Modern Art",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which objects of artistic, cultural, historical or scientific interest are kept and shown to the public",
                    "vi": "một tòa nhà trong đó các đối tượng nghệ thuật, văn hóa, lịch sử hoặc khoa học được lưu giữ và giới thiệu cho công chúng"
                },
                "examples": [
                    {
                        "en": "a museum of modern art",
                        "vi": "một bảo tàng nghệ thuật hiện đại"
                    },
                    {
                        "en": "a science museum",
                        "vi": "một bảo tàng khoa học"
                    },
                    {
                        "en": "They visited museums and galleries throughout the city.",
                        "vi": "Họ đã đến thăm các viện bảo tàng và phòng trưng bày khắp thành phố."
                    },
                    {
                        "en": "He's the director of a new museum.",
                        "vi": "Anh ấy là giám đốc của một viện bảo tàng mới."
                    },
                    {
                        "en": "at/in a museum The items will go on display at the museum next year.",
                        "vi": "at / in a Museum Các vật phẩm sẽ được trưng bày tại bảo tàng vào năm sau."
                    },
                    {
                        "en": "a museum director/curator",
                        "vi": "giám đốc bảo tàng / giám tuyển"
                    },
                    {
                        "en": "Her prints are in major museum collections.",
                        "vi": "Các bản in của cô nằm trong các bộ sưu tập lớn của bảo tàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "913334d5335b4e908b96ad1660cb6d03",
        "word": "post office",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpəʊst ɒfɪs/",
            "us": "/ˈpəʊst ɑːfɪs/"
        },
        "nearby": [
            {
                "word": "postnatal",
                "pos": "adjective"
            },
            {
                "word": "postnatal depression",
                "pos": "noun"
            },
            {
                "word": "post office",
                "pos": "noun"
            },
            {
                "word": "post office box",
                "pos": "noun"
            },
            {
                "word": "post-operative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can buy stamps, send letters, etc.",
                    "vi": "nơi bạn có thể mua tem, gửi thư, v.v."
                },
                "examples": [
                    {
                        "en": "Where's the main post office?",
                        "vi": "Bưu điện chính ở đâu?"
                    },
                    {
                        "en": "You can buy your stamps at the post office.",
                        "vi": "Bạn có thể mua tem của bạn tại bưu điện."
                    },
                    {
                        "en": "a post office counter",
                        "vi": "một quầy bưu điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "the national organization in many countries that is responsible for collecting and delivering letters, etc.",
                    "vi": "tổ chức quốc gia ở nhiều quốc gia chịu trách nhiệm thu thập và chuyển thư, v.v."
                },
                "examples": [
                    {
                        "en": "He works for the Post Office.",
                        "vi": "Anh ấy làm việc cho Bưu điện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a children’s game in which imaginary letters are exchanged for kisses",
                    "vi": "một trò chơi trẻ em trong đó các chữ cái tưởng tượng được trao cho nụ hôn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d2237d640d6d457e9d30635938ade3f3",
        "word": "school",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/skuːl/",
            "us": "/skuːl/"
        },
        "nearby": [
            {
                "word": "scholastic",
                "pos": "adjective"
            },
            {
                "word": "scholasticism",
                "pos": "noun"
            },
            {
                "word": "school",
                "pos": "noun"
            },
            {
                "word": "school",
                "pos": "verb"
            },
            {
                "word": "school age",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where children go to be educated",
                    "vi": "một nơi mà trẻ em đến để được giáo dục"
                },
                "examples": [
                    {
                        "en": "My brother and I went to the same school.",
                        "vi": "Tôi và anh trai học cùng trường."
                    },
                    {
                        "en": "(formal) Which school do they attend?",
                        "vi": "(chính thức) Họ học trường nào?"
                    },
                    {
                        "en": "I'm going to the school today to talk to Kim's teacher.",
                        "vi": "Hôm nay tôi sẽ đến trường để nói chuyện với giáo viên của Kim."
                    },
                    {
                        "en": "We need more money for roads, hospitals and schools.",
                        "vi": "Chúng tôi cần nhiều tiền hơn cho đường xá, bệnh viện và trường học."
                    },
                    {
                        "en": "The charity runs projects at local schools and youth organizations.",
                        "vi": "Tổ chức từ thiện thực hiện các dự án tại các trường học địa phương và các tổ chức thanh niên."
                    },
                    {
                        "en": "a girls'/boys' school",
                        "vi": "một trường nữ sinh / nam sinh"
                    },
                    {
                        "en": "school for somebody a school for autistic children",
                        "vi": "trường học cho ai đó trường học cho trẻ tự kỷ"
                    },
                    {
                        "en": "school buildings",
                        "vi": "trường học"
                    },
                    {
                        "en": "The kids get the school bus every morning.",
                        "vi": "Những đứa trẻ nhận được xe buýt của trường mỗi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of learning in a school; the time during your life when you go to a school",
                    "vi": "quá trình học tập trong một trường học; thời gian trong cuộc sống của bạn khi bạn đi học"
                },
                "examples": [
                    {
                        "en": "(British English) to start/leave school",
                        "vi": "(Tiếng Anh Anh) để bắt đầu / rời trường"
                    },
                    {
                        "en": "(North American English) to start/quit school",
                        "vi": "(Tiếng Anh Bắc Mỹ) để bắt đầu / nghỉ học"
                    },
                    {
                        "en": "Where did you go to school?",
                        "vi": "Bạn đã đi học ở đâu?"
                    },
                    {
                        "en": "(British English) at school All my kids are still at school.",
                        "vi": "(Tiếng Anh Anh) ở trường Tất cả những đứa trẻ của tôi vẫn đang ở trường."
                    },
                    {
                        "en": "Can you remember you first day at school?",
                        "vi": "Bạn có thể nhớ bạn ngày đầu tiên đến trường?"
                    },
                    {
                        "en": "(North American English) in school All my kids are still in school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) ở trường Tất cả các con tôi vẫn đang đi học."
                    },
                    {
                        "en": "(North American English) to teach school (= teach in a school)",
                        "vi": "(Tiếng Anh Bắc Mỹ) để dạy học (= dạy trong trường học)"
                    },
                    {
                        "en": "The transition from school to work can be difficult.",
                        "vi": "Quá trình chuyển đổi từ trường học sang nơi làm việc có thể khó khăn."
                    },
                    {
                        "en": "The school year was nearly over.",
                        "vi": "Năm học đã gần kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time during the day when children are working in a school",
                    "vi": "thời gian trong ngày khi trẻ em đi làm ở trường"
                },
                "examples": [
                    {
                        "en": "School begins at 9.",
                        "vi": "Trường học bắt đầu lúc 9 giờ."
                    },
                    {
                        "en": "after school Shall I meet you after school today?",
                        "vi": "Sau giờ học, tôi có thể gặp bạn sau giờ học hôm nay không?"
                    },
                    {
                        "en": "at/in school The kids are at/in school until 3.30.",
                        "vi": "at / in school Những đứa trẻ ở / ở trường cho đến 3 giờ 30."
                    },
                    {
                        "en": "off school I'm off school this week.",
                        "vi": "nghỉ học Tôi nghỉ học tuần này."
                    },
                    {
                        "en": "(especially British English) His mum kept him off school for two weeks when he was ill.",
                        "vi": "(đặc biệt là tiếng Anh Anh) Mẹ của anh ấy đã cho anh ấy nghỉ học trong hai tuần khi anh ấy bị ốm."
                    },
                    {
                        "en": "out of school (North American English) His mom kept him out of school for two weeks when he was sick.",
                        "vi": "nghỉ học (tiếng Anh Bắc Mỹ) Mẹ anh ấy đã cấm anh ấy nghỉ học trong hai tuần khi anh ấy bị ốm."
                    },
                    {
                        "en": "My parents let me stay home from school yesterday.",
                        "vi": "Hôm qua bố mẹ cho tôi nghỉ học ở nhà."
                    },
                    {
                        "en": "after-school activities",
                        "vi": "các hoạt động sau giờ học"
                    },
                    {
                        "en": "The next day was Monday, a school day.",
                        "vi": "Ngày hôm sau là thứ Hai, một ngày học."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the children or students and the teachers in a school",
                    "vi": "tất cả trẻ em hoặc học sinh và giáo viên trong một trường học"
                },
                "examples": [
                    {
                        "en": "I had to stand up in front of the whole school.",
                        "vi": "Tôi đã phải đứng lên trước toàn trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people go to learn a particular subject or skill",
                    "vi": "một nơi mà mọi người đến để học một chủ đề hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "a drama/language/riding school",
                        "vi": "một bộ phim truyền hình / ngôn ngữ / trường dạy cưỡi ngựa"
                    },
                    {
                        "en": "He runs a karate school in San Jose, California.",
                        "vi": "Anh ấy điều hành một trường dạy karate ở San Jose, California."
                    },
                    {
                        "en": "She wants to go to art school.",
                        "vi": "Cô ấy muốn đi học trường nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a college or university; the time that you spend there",
                    "vi": "một trường cao đẳng hoặc đại học; thời gian mà bạn dành ở đó"
                },
                "examples": [
                    {
                        "en": "famous schools like Yale and Harvard",
                        "vi": "các trường nổi tiếng như Yale và Harvard"
                    },
                    {
                        "en": "Where did you go to school?",
                        "vi": "Bạn đã đi học ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a department of a college or university that teaches a particular subject",
                    "vi": "một khoa của trường cao đẳng hoặc đại học dạy một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "the business/law/medical school",
                        "vi": "trường kinh doanh / luật / y khoa"
                    },
                    {
                        "en": "school of something the School of Dentistry",
                        "vi": "trường của cái gì đó Trường nha khoa"
                    },
                    {
                        "en": "He was determined to get into medical school.",
                        "vi": "Anh quyết tâm thi vào trường y."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of writers, artists, etc. whose style of work or opinions have been influenced by the same person or ideas",
                    "vi": "một nhóm các nhà văn, nghệ sĩ, v.v. có phong cách làm việc hoặc quan điểm đã bị ảnh hưởng bởi cùng một người hoặc ý tưởng"
                },
                "examples": [
                    {
                        "en": "the Dutch school of painting",
                        "vi": "trường phái hội họa Hà Lan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of fish or other sea animals, swimming together",
                    "vi": "một số lượng lớn cá hoặc động vật biển khác, bơi cùng nhau"
                },
                "examples": [
                    {
                        "en": "a school of dolphins",
                        "vi": "trường dạy cá heo"
                    }
                ]
            },
            {
                "define": {
                    "en": "an old-fashioned person who likes to do things as they were done in the past",
                    "vi": "một người cổ hủ thích làm những việc như họ đã từng làm trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of thinking that a number of people share",
                    "vi": "một cách suy nghĩ mà một số người chia sẻ"
                },
                "examples": [
                    {
                        "en": "There are two schools of thought about how this illness should be treated.",
                        "vi": "Có hai luồng suy nghĩ về cách điều trị căn bệnh này."
                    },
                    {
                        "en": "He belongs to the school of thought that says that competition can be very stimulating for children.",
                        "vi": "Ông thuộc trường phái tư tưởng cho rằng cạnh tranh có thể rất kích thích trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "very fashionable",
                    "vi": "rất thời trang"
                },
                "examples": [
                    {
                        "en": "The assistants look like they're too cool for school.",
                        "vi": "Các trợ lý trông giống như họ quá tuyệt khi đi học."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c082114814a4408837be53b363e6dd8",
        "word": "station",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsteɪʃn/",
            "us": "/ˈsteɪʃn/"
        },
        "nearby": [
            {
                "word": "static electricity",
                "pos": "noun"
            },
            {
                "word": "statin",
                "pos": "noun"
            },
            {
                "word": "station",
                "pos": "noun"
            },
            {
                "word": "station",
                "pos": "verb"
            },
            {
                "word": "station agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where trains stop so that passengers can get on and off; the buildings connected with this",
                    "vi": "nơi dừng tàu để hành khách lên xuống tàu; những tòa nhà kết nối với cái này"
                },
                "examples": [
                    {
                        "en": "the main station",
                        "vi": "nhà ga chính"
                    },
                    {
                        "en": "Euston Station",
                        "vi": "Ga Euston"
                    },
                    {
                        "en": "a train station",
                        "vi": "Một ga tàu"
                    },
                    {
                        "en": "(British English also) a railway station",
                        "vi": "(Anh cũng có tiếng Anh) ga đường sắt"
                    },
                    {
                        "en": "(British English) a tube/an underground station",
                        "vi": "(Tiếng Anh Anh) một ống / một ga tàu điện ngầm"
                    },
                    {
                        "en": "(North American English) a subway station",
                        "vi": "(Tiếng Anh Bắc Mỹ) ga tàu điện ngầm"
                    },
                    {
                        "en": "at a station I get off at the next station.",
                        "vi": "tại một ga tôi xuống ở ga tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where buses stop; the buildings connected with this",
                    "vi": "nơi dừng xe buýt; những tòa nhà kết nối với cái này"
                },
                "examples": [
                    {
                        "en": "We waited for him at the bus station.",
                        "vi": "Chúng tôi đợi anh ấy ở bến xe."
                    },
                    {
                        "en": "(British English also) a coach station",
                        "vi": "(Anh cũng có tiếng Anh) một trạm xe buýt"
                    },
                    {
                        "en": "Victoria Coach Station",
                        "vi": "Bến xe khách Victoria"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or building where a service is organized and provided or a special type of work is done",
                    "vi": "một địa điểm hoặc tòa nhà nơi dịch vụ được tổ chức và cung cấp hoặc một loại công việc đặc biệt được thực hiện"
                },
                "examples": [
                    {
                        "en": "Report the theft at the nearest police station.",
                        "vi": "Báo vụ trộm tại đồn cảnh sát gần nhất."
                    },
                    {
                        "en": "(British English) a petrol station",
                        "vi": "(Tiếng Anh Anh) một trạm xăng"
                    },
                    {
                        "en": "(North American English) a gas station",
                        "vi": "(Tiếng Anh Bắc Mỹ) một trạm xăng"
                    },
                    {
                        "en": "a pollution monitoring station",
                        "vi": "một trạm giám sát ô nhiễm"
                    },
                    {
                        "en": "an agricultural research station",
                        "vi": "một trạm nghiên cứu nông nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a radio or television company and the programmes it broadcasts",
                    "vi": "một công ty phát thanh hoặc truyền hình và các chương trình mà nó phát sóng"
                },
                "examples": [
                    {
                        "en": "a local radio/television/TV station",
                        "vi": "đài phát thanh / truyền hình / truyền hình địa phương"
                    },
                    {
                        "en": "He tuned to another station.",
                        "vi": "Anh điều chỉnh sang một đài khác."
                    },
                    {
                        "en": "The station broadcasts 24 hours a day.",
                        "vi": "Đài phát sóng 24 giờ một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "your social position",
                    "vi": "vị trí xã hội của bạn"
                },
                "examples": [
                    {
                        "en": "above your station She was definitely getting ideas above her station.",
                        "vi": "phía trên trạm của bạn Cô ấy chắc chắn đang lấy ý tưởng ở phía trên trạm của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where somebody has to wait and watch or be ready to do work if needed",
                    "vi": "một nơi mà ai đó phải đợi và xem hoặc sẵn sàng làm việc nếu cần"
                },
                "examples": [
                    {
                        "en": "You are not to leave your station without permission.",
                        "vi": "Bạn không được rời khỏi trạm của mình mà không có sự cho phép."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large sheep or cattle farm in Australia or New Zealand",
                    "vi": "một trang trại cừu hoặc gia súc lớn ở Úc hoặc New Zealand"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small base for the army or navy; the people living in it",
                    "vi": "một căn cứ nhỏ cho quân đội hoặc hải quân; những người sống trong đó"
                },
                "examples": [
                    {
                        "en": "a naval station",
                        "vi": "một trạm hải quân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time",
                    "vi": "một tình huống mà mọi người cảm thấy rất lo lắng và có rất nhiều hoạt động bối rối, đặc biệt là vì có rất nhiều việc phải làm trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "It was panic stations when the deadline was brought forward by a week.",
                        "vi": "Đó là các trạm hoảng loạn khi thời hạn được đưa ra trước một tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "45201e62ada74a9a9b4b7f4ecf7dfa84",
        "word": "swimming pool",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈswɪmɪŋ puːl/",
            "us": "/ˈswɪmɪŋ puːl/"
        },
        "nearby": [
            {
                "word": "swimming costume",
                "pos": "noun"
            },
            {
                "word": "swimmingly",
                "pos": "adverb"
            },
            {
                "word": "swimming pool",
                "pos": "noun"
            },
            {
                "word": "swimming trunks",
                "pos": "noun"
            },
            {
                "word": "swimsuit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of water that has been created for people to swim in",
                    "vi": "một vùng nước đã được tạo ra để mọi người bơi vào"
                },
                "examples": [
                    {
                        "en": "an indoor/outdoor swimming pool",
                        "vi": "bể bơi trong nhà / ngoài trời"
                    },
                    {
                        "en": "a heated swimming pool",
                        "vi": "một bể bơi nước nóng"
                    },
                    {
                        "en": "an open-air swimming pool",
                        "vi": "bể bơi ngoài trời"
                    }
                ]
            },
            {
                "define": {
                    "en": "the building that contains a public swimming pool",
                    "vi": "tòa nhà có bể bơi công cộng"
                },
                "examples": [
                    {
                        "en": "She trained five times a week at her local swimming pool.",
                        "vi": "Cô tập luyện năm lần một tuần tại hồ bơi địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8f8435b95bb4bacb3999a391af99374",
        "word": "theatre",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈθɪətə(r)/",
            "us": "/ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "THE",
                "pos": ""
            },
            {
                "word": "Thea",
                "pos": ""
            },
            {
                "word": "theatre",
                "pos": "noun"
            },
            {
                "word": "theatregoer",
                "pos": "noun"
            },
            {
                "word": "theatre-going",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or an outdoor area where plays and similar types of entertainment are performed",
                    "vi": "một tòa nhà hoặc một khu vực ngoài trời nơi biểu diễn các vở kịch và các loại hình giải trí tương tự"
                },
                "examples": [
                    {
                        "en": "Broadway theatres",
                        "vi": "Rạp hát Broadway"
                    },
                    {
                        "en": "an open-air theatre",
                        "vi": "một nhà hát ngoài trời"
                    },
                    {
                        "en": "How often do you go to the theatre?",
                        "vi": "Bạn thường đến rạp chiếu phim như thế nào?"
                    },
                    {
                        "en": "She left the theatre a few minutes after the curtain fell.",
                        "vi": "Cô rời rạp vài phút sau khi tấm màn hạ xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "They arrived at the movie theater a few minutes later.",
                        "vi": "Họ đến rạp chiếu phim vài phút sau đó."
                    },
                    {
                        "en": "I urge you to go see this film when it comes to a theater near you.",
                        "vi": "Tôi mong các bạn hãy đi xem bộ phim này khi nó đến rạp gần bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "plays considered as entertainment",
                    "vi": "những vở kịch được coi là giải trí"
                },
                "examples": [
                    {
                        "en": "an evening of live music and theatre",
                        "vi": "một buổi tối nhạc sống và sân khấu"
                    },
                    {
                        "en": "(British English) I like music, theatre and cinema.",
                        "vi": "(Anh Anh) Tôi thích âm nhạc, sân khấu và điện ảnh."
                    },
                    {
                        "en": "current ideas about what makes good theatre (= what makes good entertainment when performed)",
                        "vi": "những ý tưởng hiện tại về những gì tạo nên một rạp hát tốt (= những gì tạo nên sự giải trí tốt khi được trình diễn)"
                    },
                    {
                        "en": "We're huge fans of musical theatre.",
                        "vi": "Chúng tôi rất hâm mộ sân khấu âm nhạc."
                    },
                    {
                        "en": "live/street/youth theatre",
                        "vi": "nhà hát trực tiếp / đường phố / thanh niên"
                    },
                    {
                        "en": "a theatre critic",
                        "vi": "một nhà phê bình sân khấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the work of writing, producing and acting in plays",
                    "vi": "công việc viết, sản xuất và diễn xuất trong các vở kịch"
                },
                "examples": [
                    {
                        "en": "I want to work in theatre.",
                        "vi": "Tôi muốn làm việc trong nhà hát."
                    },
                    {
                        "en": "a theatre troupe/company",
                        "vi": "một đoàn kịch / công ty"
                    },
                    {
                        "en": "He had never done musical theatre when he landed the lead role as the Phantom.",
                        "vi": "Anh ấy chưa bao giờ đóng phim ca nhạc khi đảm nhận vai chính là Bóng ma."
                    },
                    {
                        "en": "He was essentially a man of the theatre.",
                        "vi": "Về cơ bản anh ta là một người đàn ông của nhà hát."
                    },
                    {
                        "en": "He wants to go into the theatre when he finishes university.",
                        "vi": "Anh ấy muốn vào nhà hát khi học xong đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a hospital used for medical operations",
                    "vi": "một căn phòng trong bệnh viện được sử dụng cho các hoạt động y tế"
                },
                "examples": [
                    {
                        "en": "a theatre sister (= a nurse who helps during operations)",
                        "vi": "một chị trong rạp hát (= một y tá giúp đỡ trong quá trình phẫu thuật)"
                    },
                    {
                        "en": "in theatre He's still in theatre.",
                        "vi": "trong rạp hát Anh ấy vẫn ở trong rạp hát."
                    },
                    {
                        "en": "He's already been taken to theatre for the operation.",
                        "vi": "Anh ấy đã được đưa đến nhà hát để phẫu thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in which a war or fighting takes place",
                    "vi": "nơi xảy ra chiến tranh hoặc giao tranh"
                },
                "examples": [
                    {
                        "en": "an intelligence officer in the Pacific theatre",
                        "vi": "một sĩ quan tình báo ở nhà hát Thái Bình Dương"
                    },
                    {
                        "en": "Russia replied by opening up a new theatre of war in the Balkans.",
                        "vi": "Nga đã trả lời bằng cách mở một sân khấu chiến tranh mới ở Balkan."
                    }
                ]
            }
        ]
    },
    {
        "id": "29548841fb724197a14560a89555f9f7",
        "word": "art gallery",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɑːt ɡæləri/",
            "us": "/ˈɑːrt ɡæləri/"
        },
        "nearby": [
            {
                "word": "artfully",
                "pos": "adverb"
            },
            {
                "word": "the Art Fund",
                "pos": ""
            },
            {
                "word": "art gallery",
                "pos": "noun"
            },
            {
                "word": "art history",
                "pos": "noun"
            },
            {
                "word": "art house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where paintings and other works of art are shown to the public",
                    "vi": "một tòa nhà nơi các bức tranh và các tác phẩm nghệ thuật khác được giới thiệu cho công chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a76ae18c94e4f6e8e4693bcdf88e947",
        "word": "club",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/klʌb/",
            "us": "/klʌb/"
        },
        "nearby": [
            {
                "word": "cloyingly",
                "pos": "adverb"
            },
            {
                "word": "cloze test",
                "pos": "noun"
            },
            {
                "word": "club",
                "pos": "noun"
            },
            {
                "word": "club",
                "pos": "verb"
            },
            {
                "word": "clubber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization for people who share an interest or do a sport or activity together",
                    "vi": "một tổ chức dành cho những người có chung sở thích hoặc cùng tham gia một môn thể thao hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "a golf/tennis/chess/film club",
                        "vi": "câu lạc bộ chơi gôn / tennis / cờ vua / điện ảnh"
                    },
                    {
                        "en": "I joined a local canoeing club.",
                        "vi": "Tôi tham gia một câu lạc bộ bơi xuồng ở địa phương."
                    },
                    {
                        "en": "They belong to the same golf club.",
                        "vi": "Họ thuộc cùng một câu lạc bộ golf."
                    },
                    {
                        "en": "Grandad is a member of the bowling club.",
                        "vi": "Ông ngoại là thành viên của câu lạc bộ bowling."
                    },
                    {
                        "en": "For details on club membership email the address below.",
                        "vi": "Để biết thông tin chi tiết về thành viên câu lạc bộ, hãy gửi email đến địa chỉ bên dưới."
                    },
                    {
                        "en": "The club hopes to raise at least $10 000 for six local charities.",
                        "vi": "Câu lạc bộ hy vọng sẽ quyên góp được ít nhất $ 10 000 cho sáu tổ chức từ thiện địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the building or rooms that a particular club uses",
                    "vi": "tòa nhà hoặc các phòng mà một câu lạc bộ cụ thể sử dụng"
                },
                "examples": [
                    {
                        "en": "We had lunch at the golf club.",
                        "vi": "Chúng tôi ăn trưa tại câu lạc bộ golf."
                    },
                    {
                        "en": "the club bar",
                        "vi": "quán bar câu lạc bộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a professional sports organization that includes the players, managers, owners and members",
                    "vi": "một tổ chức thể thao chuyên nghiệp bao gồm người chơi, người quản lý, chủ sở hữu và các thành viên"
                },
                "examples": [
                    {
                        "en": "Manchester United Football Club",
                        "vi": "Câu lạc bộ bóng đá Manchester United"
                    },
                    {
                        "en": "a football/rugby/soccer club",
                        "vi": "một câu lạc bộ bóng đá / bóng bầu dục / bóng đá"
                    },
                    {
                        "en": "The club have signed a new coach for next season.",
                        "vi": "Câu lạc bộ đã ký hợp đồng với một huấn luyện viên mới cho mùa giải tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people, especially young people, go and listen to music, dance, watch comedy, etc.",
                    "vi": "nơi mà mọi người, đặc biệt là giới trẻ, đến nghe nhạc, khiêu vũ, xem hài kịch, v.v."
                },
                "examples": [
                    {
                        "en": "a jazz club",
                        "vi": "một câu lạc bộ nhạc jazz"
                    },
                    {
                        "en": "the club scene in Newcastle",
                        "vi": "bối cảnh câu lạc bộ ở Newcastle"
                    },
                    {
                        "en": "a night out at a comedy club",
                        "vi": "một đêm đi chơi ở câu lạc bộ hài kịch"
                    }
                ]
            },
            {
                "define": {
                    "en": "(especially in the UK) an organization and a place where people can meet together socially or stay",
                    "vi": "(đặc biệt là ở Vương quốc Anh) một tổ chức và một nơi mà mọi người có thể gặp nhau xã giao hoặc ở lại"
                },
                "examples": [
                    {
                        "en": "He's a member of several London clubs.",
                        "vi": "Anh ấy là thành viên của một số câu lạc bộ ở London."
                    },
                    {
                        "en": "members of an exclusive club",
                        "vi": "thành viên của một câu lạc bộ độc quyền"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business that offers items or services cheaply to its members",
                    "vi": "một doanh nghiệp cung cấp các mặt hàng hoặc dịch vụ với giá rẻ cho các thành viên của mình"
                },
                "examples": [
                    {
                        "en": "Car club members can hire cars at special discount rates.",
                        "vi": "Các thành viên câu lạc bộ ô tô có thể thuê ô tô với mức chiết khấu đặc biệt."
                    },
                    {
                        "en": "The book club requires members to buy at least six books in the first year.",
                        "vi": "Câu lạc bộ sách yêu cầu các thành viên mua ít nhất sáu cuốn sách trong năm đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a heavy stick with one end thicker than the other, that is used as a weapon",
                    "vi": "một cây gậy nặng với một đầu dày hơn đầu kia, được sử dụng làm vũ khí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long metal stick with a piece of metal or wood at one end, used for hitting the ball in golf",
                    "vi": "một cây gậy kim loại dài với một mảnh kim loại hoặc gỗ ở một đầu, được sử dụng để đánh bóng trong gôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the four suits (= sets) in a pack of cards. The clubs have a black design with shapes like three black leaves on a short stem.",
                    "vi": "một trong bốn bộ (= bộ) trong một gói thẻ. Các câu lạc bộ có thiết kế màu đen với hình dạng giống như ba chiếc lá đen trên một thân ngắn."
                },
                "examples": [
                    {
                        "en": "the five/queen/ace of clubs",
                        "vi": "năm / nữ hoàng / át chủ bài của câu lạc bộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "one card from the suit called clubs",
                    "vi": "một thẻ từ bộ đồ được gọi là câu lạc bộ"
                },
                "examples": [
                    {
                        "en": "I played a club.",
                        "vi": "Tôi đã chơi một câu lạc bộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be pregnant",
                    "vi": "có thai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when something bad that has happened to somebody else has also happened to you",
                    "vi": "được sử dụng khi điều gì đó tồi tệ đã xảy ra với người khác cũng đã xảy ra với bạn"
                },
                "examples": [
                    {
                        "en": "So you didn't get a job either? Join the club!",
                        "vi": "Vậy là bạn cũng không kiếm được việc làm? Tham gia câu lạc bộ!"
                    }
                ]
            }
        ]
    },
    {
        "id": "9134d6b55f5a4e3192c1fa24a7847bbc",
        "word": "police station",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pəˈliːs steɪʃn/",
            "us": "/pəˈliːs steɪʃn/"
        },
        "nearby": [
            {
                "word": "the Police Service of Northern Ireland",
                "pos": ""
            },
            {
                "word": "police state",
                "pos": "noun"
            },
            {
                "word": "police station",
                "pos": "noun"
            },
            {
                "word": "policewoman",
                "pos": "noun"
            },
            {
                "word": "policing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the office of a local police force",
                    "vi": "văn phòng của lực lượng cảnh sát địa phương"
                },
                "examples": [
                    {
                        "en": "The suspect was taken to the nearest police station for questioning.",
                        "vi": "Nghi phạm đã được đưa đến đồn cảnh sát gần nhất để thẩm vấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "96223b153969473693c451a7d3656276",
        "word": "pub",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pʌb/",
            "us": "/pʌb/"
        },
        "nearby": [
            {
                "word": "PTSD",
                "pos": "abbreviation"
            },
            {
                "word": "Pty",
                "pos": "abbreviation"
            },
            {
                "word": "pub",
                "pos": "noun"
            },
            {
                "word": "pub crawl",
                "pos": "noun"
            },
            {
                "word": "pube",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where people go to drink and meet their friends. Pubs serve alcoholic and other drinks, and often also food.",
                    "vi": "một tòa nhà nơi mọi người đi uống rượu và gặp gỡ bạn bè của họ. Các quán rượu phục vụ đồ uống có cồn và khác, và thường có cả đồ ăn."
                },
                "examples": [
                    {
                        "en": "We're all going to the pub after work.",
                        "vi": "Tất cả chúng ta sẽ đến quán rượu sau giờ làm việc."
                    },
                    {
                        "en": "(informal) They've gone down the pub for a drink.",
                        "vi": "(thân mật) Họ đã đi xuống quán rượu để uống."
                    },
                    {
                        "en": "in a pub They spent the whole evening in the pub.",
                        "vi": "trong một quán rượu Họ đã dành cả buổi tối trong quán rượu."
                    },
                    {
                        "en": "at a pub He is one of the regulars at the pub.",
                        "vi": "tại một quán rượu Anh ấy là một trong những người thường trực tại quán rượu."
                    },
                    {
                        "en": "I got home from the pub just after 11.",
                        "vi": "Tôi trở về nhà từ quán rượu sau 11 giờ."
                    },
                    {
                        "en": "a pub lunch",
                        "vi": "bữa trưa ở quán rượu"
                    },
                    {
                        "en": "the landlord of the local pub",
                        "vi": "chủ nhà của quán rượu địa phương"
                    },
                    {
                        "en": "The Elm Tree will remain a traditional village pub.",
                        "vi": "The Elm Tree sẽ vẫn là một quán rượu truyền thống của làng."
                    },
                    {
                        "en": "We are holding a pub quiz in the bar on Tuesday night.",
                        "vi": "Chúng tôi sẽ tổ chức một cuộc thi đố vui về quán rượu trong quán bar vào tối thứ Ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9b53203b3e340e39c95f80c39951dd9",
        "word": "shopping centre",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈʃɒpɪŋ sentə(r)/",
            "us": "/ˈʃɑːpɪŋ sentər/"
        },
        "nearby": [
            {
                "word": "shopping bag",
                "pos": "noun"
            },
            {
                "word": "shopping cart",
                "pos": "noun"
            },
            {
                "word": "shopping centre",
                "pos": "noun"
            },
            {
                "word": "shopping days to Christmas",
                "pos": ""
            },
            {
                "word": "shopping list",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of shops built together, sometimes under one roof",
                    "vi": "một nhóm các cửa hàng được xây dựng cùng nhau, đôi khi dưới một mái nhà"
                },
                "examples": [
                    {
                        "en": "Kendal boasts a modern shopping centre and a museum.",
                        "vi": "Kendal tự hào có một trung tâm mua sắm hiện đại và một viện bảo tàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "11722abb07f340bca1db0be014a2fe24",
        "word": "sports centre",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈspɔːts sentə(r)/",
            "us": "/ˈspɔːrts sentər/"
        },
        "nearby": [
            {
                "word": "sportscast",
                "pos": "noun"
            },
            {
                "word": "sportscaster",
                "pos": "noun"
            },
            {
                "word": "sports centre",
                "pos": "noun"
            },
            {
                "word": "sports day",
                "pos": "noun"
            },
            {
                "word": "sports drink",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where the public can go to play many different kinds of sports, swim, etc.",
                    "vi": "một tòa nhà nơi công chúng có thể đến chơi nhiều loại thể thao khác nhau, bơi lội, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9e841977ff0544ada04801949d8f2305",
        "word": "court",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kɔːt/",
            "us": "/kɔːrt/"
        },
        "nearby": [
            {
                "word": "coursework",
                "pos": "noun"
            },
            {
                "word": "coursing",
                "pos": "noun"
            },
            {
                "word": "court",
                "pos": "noun"
            },
            {
                "word": "court",
                "pos": "verb"
            },
            {
                "word": "the Courtauld Institute",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where legal trials take place and where crimes, etc. are judged",
                    "vi": "nơi diễn ra các phiên tòa pháp lý và nơi xét xử tội ác, v.v."
                },
                "examples": [
                    {
                        "en": "the civil/criminal courts",
                        "vi": "tòa án dân sự / hình sự"
                    },
                    {
                        "en": "Her lawyer made a statement outside the court.",
                        "vi": "Luật sư của cô đã đưa ra một tuyên bố bên ngoài tòa án."
                    },
                    {
                        "en": "in court Relatives of the dead girl were in court.",
                        "vi": "tại tòa án Những người thân của cô gái đã chết có mặt tại tòa án."
                    },
                    {
                        "en": "She will appear in court tomorrow.",
                        "vi": "Cô ấy sẽ ra hầu tòa vào ngày mai."
                    },
                    {
                        "en": "to court They took their landlord to court for breaking the contract.",
                        "vi": "ra tòa Họ đã đưa chủ nhà của họ ra tòa vì đã phá vỡ hợp đồng."
                    },
                    {
                        "en": "The case took five years to come to court (= to be heard by the court).",
                        "vi": "Vụ án mất 5 năm để đưa ra tòa (= để được tòa án xét xử)."
                    },
                    {
                        "en": "There wasn't enough evidence to bring the case to court (= start a trial).",
                        "vi": "Không có đủ bằng chứng để đưa vụ việc ra tòa (= bắt đầu một phiên tòa)."
                    },
                    {
                        "en": "out of court The case was settled out of court (= a decision was reached without a trial).",
                        "vi": "ra khỏi tòa án Vụ việc đã được giải quyết ngoài tòa án (= một quyết định đã được đưa ra mà không cần xét xử)."
                    },
                    {
                        "en": "He won the court case and was awarded damages.",
                        "vi": "Anh ta đã thắng kiện tại tòa và được bồi thường thiệt hại."
                    },
                    {
                        "en": "She can't pay her tax and is facing court action.",
                        "vi": "Cô ấy không thể trả tiền thuế của mình và đang phải đối mặt với vụ kiện của tòa án."
                    },
                    {
                        "en": "During the court hearing, the prosecutor said she would seek maximum prison sentences.",
                        "vi": "Trong phiên tòa, công tố viên cho biết cô sẽ yêu cầu mức án tù tối đa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people in a court, especially those who make the decisions, such as the judge and jury",
                    "vi": "những người trong tòa án, đặc biệt là những người đưa ra quyết định, chẳng hạn như thẩm phán và bồi thẩm đoàn"
                },
                "examples": [
                    {
                        "en": "Please tell the court what happened.",
                        "vi": "Xin quý tòa cho biết chuyện gì đã xảy ra."
                    },
                    {
                        "en": "The court heard how the man collapsed after being stabbed.",
                        "vi": "Tòa án đã nghe cách người đàn ông suy sụp sau khi bị đâm."
                    },
                    {
                        "en": "The court ruled in favour of her claim.",
                        "vi": "Tòa án đã ra phán quyết có lợi cho yêu cầu của cô."
                    },
                    {
                        "en": "This is not a case to be decided by the courts.",
                        "vi": "Đây không phải là trường hợp được quyết định bởi tòa án."
                    },
                    {
                        "en": "before the court This evidence was not put before the court.",
                        "vi": "trước tòa Bằng chứng này không được đưa ra trước tòa."
                    },
                    {
                        "en": "Airlines could face huge compensation bills following a court ruling on flight delays.",
                        "vi": "Các hãng hàng không có thể phải đối mặt với các hóa đơn bồi thường khổng lồ sau phán quyết của tòa án về việc hoãn chuyến bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where games such as tennis and basketball are played",
                    "vi": "nơi chơi các trò chơi như quần vợt và bóng rổ"
                },
                "examples": [
                    {
                        "en": "a tennis/squash/basketball court",
                        "vi": "sân tennis / bóng quần / bóng rổ"
                    },
                    {
                        "en": "on court He won after only 52 minutes on court.",
                        "vi": "trên tòa Anh đã thắng chỉ sau 52 phút trên tòa."
                    },
                    {
                        "en": "off court The players are good friends off court and train together.",
                        "vi": "ngoài sân Các cầu thủ là những người bạn tốt ngoài sân và cùng nhau huấn luyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "the official place where kings and queens live",
                    "vi": "nơi chính thức nơi các vị vua và hoàng hậu sinh sống"
                },
                "examples": [
                    {
                        "en": "the court of Queen Victoria",
                        "vi": "tòa án của nữ hoàng Victoria"
                    },
                    {
                        "en": "at court He was presented to the queen at court.",
                        "vi": "tại tòa án Ông đã được trình bày với nữ hoàng tại tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "the king or queen, their family, and the people who work for them and/or give advice to them",
                    "vi": "vua hoặc hoàng hậu, gia đình của họ, và những người làm việc cho họ và / hoặc đưa ra lời khuyên cho họ"
                },
                "examples": [
                    {
                        "en": "The painting shows the emperor with his court.",
                        "vi": "Bức tranh vẽ hoàng đế với triều đình của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an open space that is partly or completely surrounded by buildings and is usually part of a castle, a large house, etc.",
                    "vi": "một không gian mở được bao quanh một phần hoặc hoàn toàn bởi các tòa nhà và thường là một phần của lâu đài, ngôi nhà lớn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used in the names of blocks of flats or apartment buildings, or of some short streets; (in the UK) used in the names of some large houses",
                    "vi": "được sử dụng trong tên của các khối căn hộ hoặc tòa nhà chung cư, hoặc của một số đường phố ngắn; (ở Anh) được sử dụng trong tên của một số ngôi nhà lớn"
                },
                "examples": [
                    {
                        "en": "The building is situated in a medieval court at the top of Edinburgh's royal mile.",
                        "vi": "Tòa nhà nằm trong một tòa án thời trung cổ ở trên cùng của dặm hoàng gia Edinburgh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large open section of a building, often with a glass roof",
                    "vi": "một phần mở lớn của tòa nhà, thường có mái kính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is your/somebody’s responsibility to take action next",
                    "vi": "đó là trách nhiệm của bạn / ai đó để thực hiện hành động tiếp theo"
                },
                "examples": [
                    {
                        "en": "They've offered me the job, so the ball's in my court now.",
                        "vi": "Họ đã mời tôi làm việc, vì vậy quả bóng đang ở trong sân của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to entertain people by telling them interesting or funny things",
                    "vi": "để giải trí mọi người bằng cách kể cho họ nghe những điều thú vị hoặc hài hước"
                },
                "examples": [
                    {
                        "en": "I met Giles holding court with some tourists in a cafe.",
                        "vi": "Tôi gặp Giles đang hầu tòa với một số khách du lịch trong một quán cà phê."
                    }
                ]
            },
            {
                "define": {
                    "en": "to completely reject an idea, a story, etc. that you think is not worth taking seriously at all",
                    "vi": "bác bỏ hoàn toàn một ý tưởng, một câu chuyện, v.v. mà bạn cho rằng không đáng để thực hiện một cách nghiêm túc"
                },
                "examples": [
                    {
                        "en": "All his attempts at explanation were simply laughed out of court.",
                        "vi": "Tất cả những nỗ lực giải thích của anh ấy chỉ đơn giản là bị cười trừ trước tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody with great respect in order to gain favour with them",
                    "vi": "đối xử với ai đó bằng sự tôn trọng tuyệt vời để có được sự ưu ái với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say that something is completely wrong or not worth considering, especially in a trial",
                    "vi": "để nói rằng có điều gì đó hoàn toàn sai hoặc không đáng được xem xét, đặc biệt là trong một phiên tòa"
                },
                "examples": [
                    {
                        "en": "The charges were thrown out of court.",
                        "vi": "Các cáo buộc đã được đưa ra khỏi tòa án."
                    },
                    {
                        "en": "Well that's my theory ruled out of court.",
                        "vi": "Đó là lý thuyết của tôi bị loại khỏi tòa án."
                    }
                ]
            }
        ]
    },
    {
        "id": "68e816c1963a41e18b49b3c8a6befb27",
        "word": "hall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/hɔːl/",
            "us": "/hɔːl/"
        },
        "nearby": [
            {
                "word": "Halifax",
                "pos": ""
            },
            {
                "word": "halitosis",
                "pos": "noun"
            },
            {
                "word": "hall",
                "pos": "noun"
            },
            {
                "word": "Peter Hall",
                "pos": ""
            },
            {
                "word": "hallelujah",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a space or passage inside the entrance or front door of a building",
                    "vi": "một không gian hoặc lối đi bên trong lối vào hoặc cửa trước của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "in a hall Her brother was standing in the front hall.",
                        "vi": "trong hội trường Anh trai cô ấy đang đứng ở tiền sảnh."
                    },
                    {
                        "en": "She ran into the hall and up the stairs.",
                        "vi": "Cô chạy vào sảnh và lên cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a passage in a building with rooms down either side",
                    "vi": "một lối đi trong một tòa nhà có các phòng ở hai bên"
                },
                "examples": [
                    {
                        "en": "down the hall I headed for Scott's office down the hall.",
                        "vi": "xuống hành lang, tôi hướng đến văn phòng của Scott."
                    },
                    {
                        "en": "across the hall the room across the hall",
                        "vi": "qua hành lang căn phòng bên kia hành lang"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building or large room for public meetings, meals, concerts, etc.",
                    "vi": "một tòa nhà hoặc phòng lớn cho các cuộc họp công cộng, bữa ăn, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "a concert/sports hall",
                        "vi": "một buổi hòa nhạc / phòng thể thao"
                    },
                    {
                        "en": "a banqueting/conference hall",
                        "vi": "phòng tiệc / hội nghị"
                    },
                    {
                        "en": "an exhibition hall",
                        "vi": "một phòng triển lãm"
                    },
                    {
                        "en": "There are three dining halls on campus.",
                        "vi": "Có ba phòng ăn trong khuôn viên trường."
                    },
                    {
                        "en": "the Royal Albert Hall",
                        "vi": "Hội trường Hoàng gia Albert"
                    },
                    {
                        "en": "in a hall The next meeting is in the community hall on Tuesday.",
                        "vi": "trong một hội trường Cuộc họp tiếp theo là trong hội trường cộng đồng vào Thứ Ba."
                    },
                    {
                        "en": "(British English) A jumble sale will be held in the village hall on Saturday.",
                        "vi": "(Tiếng Anh Anh) Một cuộc mua bán tạp nham sẽ được tổ chức tại hội trường làng vào thứ Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building for university or college students to live in",
                    "vi": "một tòa nhà cho sinh viên đại học hoặc cao đẳng ở"
                },
                "examples": [
                    {
                        "en": "in hall(s) She's living in hall(s).",
                        "vi": "trong (các) hội trường Cô ấy đang sống trong (các) hội trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large country house",
                    "vi": "một ngôi nhà nông thôn lớn"
                },
                "examples": [
                    {
                        "en": "Haddon Hall",
                        "vi": "Hội trường Haddon"
                    },
                    {
                        "en": "Berrington Hall was built in the late 18th century.",
                        "vi": "Berrington Hall được xây dựng vào cuối thế kỷ 18."
                    }
                ]
            }
        ]
    },
    {
        "id": "8710e8d832c14b9b858595ef3ebf1513",
        "word": "hostel",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhɒstl/",
            "us": "/ˈhɑːstl/"
        },
        "nearby": [
            {
                "word": "hostage taker",
                "pos": "noun"
            },
            {
                "word": "hostage-taking",
                "pos": "noun"
            },
            {
                "word": "hostel",
                "pos": "noun"
            },
            {
                "word": "hostelry",
                "pos": "noun"
            },
            {
                "word": "hostess",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building that provides cheap accommodation and sometimes meals to students, workers or travellers",
                    "vi": "một tòa nhà cung cấp chỗ ở giá rẻ và đôi khi là bữa ăn cho sinh viên, công nhân hoặc khách du lịch"
                },
                "examples": [
                    {
                        "en": "We stayed at a student hostel during the conference.",
                        "vi": "Chúng tôi đã ở tại một ký túc xá sinh viên trong suốt hội nghị."
                    },
                    {
                        "en": "Hostel accommodation is provided for the seasonal workers.",
                        "vi": "Nhà trọ cung cấp chỗ ở cho người lao động thời vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building, usually run by a charity, where people who have no home can stay for a short time",
                    "vi": "một tòa nhà, thường do một tổ chức từ thiện điều hành, nơi những người không có nhà có thể ở trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "He lives in a hostel for the homeless.",
                        "vi": "Anh ta sống trong một nhà trọ dành cho người vô gia cư."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ca0007da3a5456e8498b2c7e7630ce3",
        "word": "mall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/mɔːl/",
            "us": "/mɔːl/"
        },
        "nearby": [
            {
                "word": "malinger",
                "pos": "verb"
            },
            {
                "word": "malingerer",
                "pos": "noun"
            },
            {
                "word": "mall",
                "pos": "noun"
            },
            {
                "word": "MALL",
                "pos": "abbreviation"
            },
            {
                "word": "The Mall",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building or covered area that has many shops, restaurants, etc. inside it",
                    "vi": "một tòa nhà lớn hoặc khu vực có mái che có nhiều cửa hàng, nhà hàng, v.v. bên trong nó"
                },
                "examples": [
                    {
                        "en": "Let's go to the mall.",
                        "vi": "Hãy đi đến trung tâm mua sắm."
                    },
                    {
                        "en": "Teenagers would go hang at the mall after school.",
                        "vi": "Thanh thiếu niên sẽ đi chơi ở trung tâm mua sắm sau khi tan học."
                    },
                    {
                        "en": "Check out outlet malls (= ones which sell goods at reduced prices) and discount stores for good deals.",
                        "vi": "Kiểm tra các trung tâm mua sắm (= những trung tâm bán hàng giảm giá) và các cửa hàng giảm giá để nhận được ưu đãi tốt."
                    },
                    {
                        "en": "The friends were shopping at a mall in Columbus.",
                        "vi": "Những người bạn đang mua sắm tại một trung tâm mua sắm ở Columbus."
                    }
                ]
            }
        ]
    },
    {
        "id": "62defaffb3ae4bbdaee1e60d340de1bb",
        "word": "shopping mall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈʃɒpɪŋ mɔːl/",
            "us": "/ˈʃɑːpɪŋ mɔːl/"
        },
        "nearby": [
            {
                "word": "shopping days to Christmas",
                "pos": ""
            },
            {
                "word": "shopping list",
                "pos": "noun"
            },
            {
                "word": "shopping mall",
                "pos": "noun"
            },
            {
                "word": "shopping precinct",
                "pos": "noun"
            },
            {
                "word": "shopping trolley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building or covered area that has many shops, restaurants, etc. inside it",
                    "vi": "một tòa nhà lớn hoặc khu vực có mái che có nhiều cửa hàng, nhà hàng, v.v. bên trong nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "40e6714e1a8a4b81b38e588aa41ccaf1",
        "word": "stadium",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsteɪdiəm/",
            "us": "/ˈsteɪdiəm/"
        },
        "nearby": [
            {
                "word": "stacked",
                "pos": "adjective"
            },
            {
                "word": "stack up",
                "pos": "phrasal verb"
            },
            {
                "word": "stadium",
                "pos": "noun"
            },
            {
                "word": "staff",
                "pos": "noun"
            },
            {
                "word": "staff",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large sports ground surrounded by rows of seats and usually other buildings",
                    "vi": "một sân thể thao lớn được bao quanh bởi các hàng ghế và thường là các tòa nhà khác"
                },
                "examples": [
                    {
                        "en": "a football/sports stadium",
                        "vi": "sân vận động bóng đá / thể thao"
                    },
                    {
                        "en": "plans to build a new stadium",
                        "vi": "kế hoạch xây dựng một sân vận động mới"
                    },
                    {
                        "en": "an all-seater stadium",
                        "vi": "một sân vận động toàn chỗ ngồi"
                    }
                ]
            }
        ]
    },
    {
        "id": "25a6ac43791e4a37a35226b78f3a0722",
        "word": "town hall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌtaʊn ˈhɔːl/",
            "us": "/ˌtaʊn ˈhɔːl/"
        },
        "nearby": [
            {
                "word": "town crier",
                "pos": "noun"
            },
            {
                "word": "townee",
                "pos": "noun"
            },
            {
                "word": "town hall",
                "pos": "noun"
            },
            {
                "word": "town house",
                "pos": "noun"
            },
            {
                "word": "townie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building containing local government offices and, in the UK, usually a hall for public meetings, concerts, etc.",
                    "vi": "một tòa nhà chứa các văn phòng chính quyền địa phương và ở Vương quốc Anh, thường là hội trường dành cho các cuộc họp công cộng, các buổi hòa nhạc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "90b8a8fd4a7e4cbc8b087514cb49f0ba",
        "word": "courthouse",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɔːthaʊs/",
            "us": "/ˈkɔːrthaʊs/"
        },
        "nearby": [
            {
                "word": "courtesy light",
                "pos": "noun"
            },
            {
                "word": "courtesy title",
                "pos": "noun"
            },
            {
                "word": "courthouse",
                "pos": "noun"
            },
            {
                "word": "courtier",
                "pos": "noun"
            },
            {
                "word": "courtly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building containing courts of law",
                    "vi": "một tòa nhà có tòa án luật"
                },
                "examples": [
                    {
                        "en": "The prison is opposite the courthouse.",
                        "vi": "Nhà tù nằm đối diện với tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a building containing the offices of a county government",
                    "vi": "(ở Mỹ) một tòa nhà chứa các văn phòng của chính quyền quận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "95ef2c8945e241e2ad1c67f8ba9bf857",
        "word": "fire station",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfaɪə steɪʃn/",
            "us": "/ˈfaɪər steɪʃn/"
        },
        "nearby": [
            {
                "word": "fireside chat",
                "pos": "noun"
            },
            {
                "word": "fire starter",
                "pos": "noun"
            },
            {
                "word": "fire station",
                "pos": "noun"
            },
            {
                "word": "firestorm",
                "pos": "noun"
            },
            {
                "word": "fire trap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building for a fire brigade or fire department and its equipment",
                    "vi": "một tòa nhà cho đội cứu hỏa hoặc sở cứu hỏa và các thiết bị của nó"
                },
                "examples": [
                    {
                        "en": "The meeting had to be abandoned after local fire station officer, Dave Temple, was called away to a fire.",
                        "vi": "Cuộc họp đã phải bị hủy bỏ sau khi nhân viên trạm cứu hỏa địa phương, Dave Temple, được gọi đi chữa cháy."
                    }
                ]
            }
        ]
    },
    {
        "id": "353d73d24f0644f88f9627e699569159",
        "word": "leisure centre",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈleʒə sentə(r)/",
            "us": "/ˈliːʒər sentər/"
        },
        "nearby": [
            {
                "word": "Vivien Leigh",
                "pos": ""
            },
            {
                "word": "leisure",
                "pos": "noun"
            },
            {
                "word": "leisure centre",
                "pos": "noun"
            },
            {
                "word": "leisured",
                "pos": "adjective"
            },
            {
                "word": "leisurely",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public building where people can go to do sports and other activities in their free time",
                    "vi": "một tòa nhà công cộng, nơi mọi người có thể đến chơi thể thao và các hoạt động khác vào thời gian rảnh của họ"
                },
                "examples": [
                    {
                        "en": "There are plans for the development of a new leisure centre on the site.",
                        "vi": "Có kế hoạch phát triển một trung tâm giải trí mới trên trang web."
                    }
                ]
            }
        ]
    },
    {
        "id": "b184c72557274f9485a9f52037ed2b4f",
        "word": "opera house",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒprə haʊs/",
            "us": "/ˈɑːprə haʊs/"
        },
        "nearby": [
            {
                "word": "operable",
                "pos": "adjective"
            },
            {
                "word": "opera glasses",
                "pos": "noun"
            },
            {
                "word": "opera house",
                "pos": "noun"
            },
            {
                "word": "operand",
                "pos": "noun"
            },
            {
                "word": "operate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a theatre where operas are performed",
                    "vi": "một nhà hát nơi các vở opera được biểu diễn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "62cbc795de4e407a9f7f98dc6407eb88",
        "word": "schoolhouse",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈskuːlhaʊs/",
            "us": "/ˈskuːlhaʊs/"
        },
        "nearby": [
            {
                "word": "school friend",
                "pos": "noun"
            },
            {
                "word": "schoolgirl",
                "pos": "noun"
            },
            {
                "word": "schoolhouse",
                "pos": "noun"
            },
            {
                "word": "schoolie",
                "pos": "noun"
            },
            {
                "word": "Schoolies Week",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a school building, especially a small one in a village in the past",
                    "vi": "một trường học, đặc biệt là một ngôi trường nhỏ trong một ngôi làng trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a house for a teacher next to a small school",
                    "vi": "một ngôi nhà cho một giáo viên bên cạnh một ngôi trường nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ecdf6bccab48456f9a14df6991b20107",
        "word": "terminal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtɜːmɪnl/",
            "us": "/ˈtɜːrmɪnl/"
        },
        "nearby": [
            {
                "word": "term",
                "pos": "verb"
            },
            {
                "word": "termagant",
                "pos": "noun"
            },
            {
                "word": "terminal",
                "pos": "noun"
            },
            {
                "word": "terminal",
                "pos": "adjective"
            },
            {
                "word": "terminally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or set of buildings at an airport where passengers arrive and leave",
                    "vi": "một tòa nhà hoặc một tập hợp các tòa nhà tại sân bay nơi hành khách đến và đi"
                },
                "examples": [
                    {
                        "en": "A second terminal was opened last year.",
                        "vi": "Một nhà ga thứ hai đã được mở vào năm ngoái."
                    },
                    {
                        "en": "Your flight leaves from Terminal 3.",
                        "vi": "Chuyến bay của bạn khởi hành từ Nhà ga số 3."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place, building or set of buildings where journeys by train, bus or boat begin or end",
                    "vi": "một địa điểm, tòa nhà hoặc tập hợp các tòa nhà nơi các chuyến đi bằng tàu hỏa, xe buýt hoặc thuyền bắt đầu hoặc kết thúc"
                },
                "examples": [
                    {
                        "en": "a railway/bus/ferry terminal",
                        "vi": "một bến xe lửa / xe buýt / phà"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment, usually consisting of a keyboard and a screen that joins the user to a central computer system",
                    "vi": "một phần của thiết bị, thường bao gồm bàn phím và màn hình kết nối người dùng với một hệ thống máy tính trung tâm"
                },
                "examples": [
                    {
                        "en": "Internet terminals have been installed at most libraries.",
                        "vi": "Các thiết bị đầu cuối Internet đã được cài đặt ở hầu hết các thư viện."
                    },
                    {
                        "en": "All she did was press a few keys on the terminal.",
                        "vi": "Tất cả những gì cô ấy làm là nhấn một vài phím trên thiết bị đầu cuối."
                    },
                    {
                        "en": "The larger financial institutions have over 200 news and data terminals in their offices.",
                        "vi": "Các tổ chức tài chính lớn hơn có hơn 200 thiết bị đầu cuối tin tức và dữ liệu trong văn phòng của họ."
                    },
                    {
                        "en": "There were two students at each terminal.",
                        "vi": "Có hai học sinh ở mỗi đầu cuối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point at which connections can be made in an electric circuit",
                    "vi": "một điểm mà tại đó các kết nối có thể được thực hiện trong một mạch điện"
                },
                "examples": [
                    {
                        "en": "a positive/negative terminal",
                        "vi": "một thiết bị đầu cuối tích cực / tiêu cực"
                    }
                ]
            }
        ]
    },
    {
        "id": "f224346f38604023851678e88fc9a857",
        "word": "aquarium",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈkweəriəm/",
            "us": "/əˈkweriəm/"
        },
        "nearby": [
            {
                "word": "Aquarian",
                "pos": "adjective"
            },
            {
                "word": "Aquarian",
                "pos": "noun"
            },
            {
                "word": "aquarium",
                "pos": "noun"
            },
            {
                "word": "Aquarius",
                "pos": "noun"
            },
            {
                "word": "aquarobics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large glass container in which fish and other water creatures and plants are kept",
                    "vi": "một hộp thủy tinh lớn, trong đó cá và các sinh vật nước khác và thực vật được giữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a building where people can go to see fish and other water creatures",
                    "vi": "một tòa nhà nơi mọi người có thể đến xem cá và các sinh vật nước khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b00695999c974243b67d29ce6fadac4b",
        "word": "auction room",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɔːkʃn ruːm/",
            "us": "/ˈɔːkʃn ruːm/"
        },
        "nearby": [
            {
                "word": "auction house",
                "pos": "noun"
            },
            {
                "word": "auction off",
                "pos": "phrasal verb"
            },
            {
                "word": "auction room",
                "pos": "noun"
            },
            {
                "word": "audacious",
                "pos": "adjective"
            },
            {
                "word": "audaciously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which auctions are held",
                    "vi": "một tòa nhà trong đó các cuộc đấu giá được tổ chức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c22932d9662f46399558f8502cec2ee4",
        "word": "bowling alley",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbəʊlɪŋ æli/",
            "us": "/ˈbəʊlɪŋ æli/"
        },
        "nearby": [
            {
                "word": "bowline2",
                "pos": "noun"
            },
            {
                "word": "bowling",
                "pos": "noun"
            },
            {
                "word": "bowling alley",
                "pos": "noun"
            },
            {
                "word": "bowling ball",
                "pos": "noun"
            },
            {
                "word": "bowling green",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or part of a building where people can go bowling",
                    "vi": "một tòa nhà hoặc một phần của tòa nhà nơi mọi người có thể chơi bowling"
                },
                "examples": [
                    {
                        "en": "The complex contains a bowling alley, a pool hall and indoor tennis courts.",
                        "vi": "Khu phức hợp có sân chơi bowling, sảnh hồ bơi và các sân tennis trong nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "820ee55d5d2747d2aed1e924e5566de9",
        "word": "lighthouse",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪthaʊs/",
            "us": "/ˈlaɪthaʊs/"
        },
        "nearby": [
            {
                "word": "light-heartedly",
                "pos": "adverb"
            },
            {
                "word": "light heavyweight",
                "pos": "noun"
            },
            {
                "word": "lighthouse",
                "pos": "noun"
            },
            {
                "word": "light industry",
                "pos": "noun"
            },
            {
                "word": "lighting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tower or other building that contains a strong light to warn and guide ships near the coast",
                    "vi": "tháp hoặc tòa nhà khác có ánh sáng mạnh để cảnh báo và hướng dẫn tàu bè gần bờ biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cbbbe318d4d74048b07e049c5dcc15c8",
        "word": "multi-storey car park",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmʌlti stɔːri ˈkɑː pɑːk/",
            "us": "/ˌmʌlti stɔːri ˈkɑːr pɑːrk/"
        },
        "nearby": [
            {
                "word": "multiracial",
                "pos": "adjective"
            },
            {
                "word": "multi-skilling",
                "pos": "noun"
            },
            {
                "word": "multi-storey car park",
                "pos": "noun"
            },
            {
                "word": "multitask",
                "pos": "verb"
            },
            {
                "word": "multitasking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building with several floors for parking cars in",
                    "vi": "một tòa nhà lớn với nhiều tầng để đậu xe ô tô trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de8380857002461f8043a526a6fdccdb",
        "word": "municipal",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/mjuːˈnɪsɪpl/",
            "us": "/mjuːˈnɪsɪpl/"
        },
        "nearby": [
            {
                "word": "mung",
                "pos": "noun"
            },
            {
                "word": "the Munich Agreement",
                "pos": ""
            },
            {
                "word": "municipal",
                "pos": "adjective"
            },
            {
                "word": "municipality",
                "pos": "noun"
            },
            {
                "word": "munificence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with or belonging to a town, city or district that has its own local government",
                    "vi": "được kết nối với hoặc thuộc một thị trấn, thành phố hoặc quận có chính quyền địa phương riêng"
                },
                "examples": [
                    {
                        "en": "municipal elections/councils",
                        "vi": "bầu cử / hội đồng thành phố"
                    },
                    {
                        "en": "municipal workers",
                        "vi": "công nhân thành phố"
                    },
                    {
                        "en": "the Los Angeles Municipal Art Gallery",
                        "vi": "Phòng trưng bày nghệ thuật thành phố Los Angeles"
                    }
                ]
            }
        ]
    },
    {
        "id": "6799dd39b4634b06a3a807eddda32041",
        "word": "service station",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɜːvɪs steɪʃn/",
            "us": "/ˈsɜːrvɪs steɪʃn/"
        },
        "nearby": [
            {
                "word": "service provider",
                "pos": "noun"
            },
            {
                "word": "service road",
                "pos": "noun"
            },
            {
                "word": "service station",
                "pos": "noun"
            },
            {
                "word": "servicewoman",
                "pos": "noun"
            },
            {
                "word": "servicing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place at the side of a road where you take your car to buy petrol, oil, etc.",
                    "vi": "nơi bạn dắt xe vào mua xăng, dầu, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an area and building next to a motorway where you can buy food and petrol, go to the toilet, etc.",
                    "vi": "một khu vực và tòa nhà bên cạnh đường cao tốc, nơi bạn có thể mua thức ăn và xăng, đi vệ sinh, v.v."
                },
                "examples": [
                    {
                        "en": "We stopped for a break at a motorway service station.",
                        "vi": "Chúng tôi dừng lại để nghỉ giải lao tại một trạm dịch vụ đường cao tốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "f35431708e854b5ea7b410f971da5f2b",
        "word": "assembly room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsembli ruːm/",
            "us": "/əˈsembli ruːm/"
        },
        "nearby": [
            {
                "word": "assemblyman",
                "pos": "noun"
            },
            {
                "word": "Assembly Member",
                "pos": "noun"
            },
            {
                "word": "assembly room",
                "pos": "noun"
            },
            {
                "word": "assemblywoman",
                "pos": "noun"
            },
            {
                "word": "assent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public room or building in which meetings and social events are held",
                    "vi": "phòng công cộng hoặc tòa nhà, nơi tổ chức các cuộc họp và sự kiện xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c70927c28f654df7808c111cb263aa81",
        "word": "auditorium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɔːdɪˈtɔːriəm/",
            "us": "/ˌɔːdɪˈtɔːriəm/"
        },
        "nearby": [
            {
                "word": "audition",
                "pos": "verb"
            },
            {
                "word": "auditor",
                "pos": "noun"
            },
            {
                "word": "auditorium",
                "pos": "noun"
            },
            {
                "word": "auditory",
                "pos": "adjective"
            },
            {
                "word": "audit trail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a theatre, concert hall, etc. in which the audience sits",
                    "vi": "một phần của nhà hát, phòng hòa nhạc, v.v. trong đó khán giả ngồi"
                },
                "examples": [
                    {
                        "en": "The auditorium seats over a thousand people.",
                        "vi": "Khán phòng có hơn một nghìn người."
                    },
                    {
                        "en": "You will be taken on a guided tour of the theatre, including the stage, auditorium and backstage areas.",
                        "vi": "Bạn sẽ được hướng dẫn tham quan nhà hát, bao gồm các khu vực sân khấu, khán phòng và hậu trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large building or room in which public meetings, concerts, etc. are held",
                    "vi": "một tòa nhà hoặc phòng lớn, nơi tổ chức các cuộc họp công cộng, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "He stood at the back of the packed auditorium.",
                        "vi": "Anh đứng ở phía sau khán phòng chật cứng."
                    },
                    {
                        "en": "The new building will include an exhibition hall, auditorium, bookshop and restaurant.",
                        "vi": "Tòa nhà mới sẽ bao gồm một phòng triển lãm, khán phòng, hiệu sách và nhà hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "34c401756f234ec2aa32f06758ad99bf",
        "word": "clubhouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklʌbhaʊs/",
            "us": "/ˈklʌbhaʊs/"
        },
        "nearby": [
            {
                "word": "club foot",
                "pos": "noun"
            },
            {
                "word": "club-footed",
                "pos": "adjective"
            },
            {
                "word": "clubhouse",
                "pos": "noun"
            },
            {
                "word": "clubland",
                "pos": "noun"
            },
            {
                "word": "club sandwich",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the building used by a club, especially a sports club",
                    "vi": "tòa nhà được sử dụng bởi một câu lạc bộ, đặc biệt là một câu lạc bộ thể thao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "674c97b196074c5c9f61be60c7336518",
        "word": "crematorium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkreməˈtɔːriəm/",
            "us": "/ˌkriːməˈtɔːriəm/"
        },
        "nearby": [
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            },
            {
                "word": "crème brûlée",
                "pos": "noun"
            },
            {
                "word": "crème caramel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which the bodies of dead people are burned",
                    "vi": "tòa nhà thiêu xác người chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca20ab0f9b4f4953804e438fbe15c5a7",
        "word": "hospice",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒspɪs/",
            "us": "/ˈhɑːspɪs/"
        },
        "nearby": [
            {
                "word": "hoser",
                "pos": "noun"
            },
            {
                "word": "hosiery",
                "pos": "noun"
            },
            {
                "word": "hospice",
                "pos": "noun"
            },
            {
                "word": "the hospice movement",
                "pos": ""
            },
            {
                "word": "hospitable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hospital for people who are dying",
                    "vi": "bệnh viện dành cho những người sắp chết"
                },
                "examples": [
                    {
                        "en": "She founded an AIDS hospice with the help of a local doctor.",
                        "vi": "Cô đã thành lập một trại tế bần về AIDS với sự giúp đỡ của một bác sĩ địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "3b4896cac4974251898683a7b35c23f9",
        "word": "morgue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɔːɡ/",
            "us": "/mɔːrɡ/"
        },
        "nearby": [
            {
                "word": "Rhodri Morgan",
                "pos": ""
            },
            {
                "word": "morganatic",
                "pos": "adjective"
            },
            {
                "word": "morgue",
                "pos": "noun"
            },
            {
                "word": "Professor Moriarty",
                "pos": ""
            },
            {
                "word": "moribund",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which dead bodies are kept before they are buried or cremated (= burned)",
                    "vi": "một tòa nhà trong đó xác người chết được lưu giữ trước khi chôn cất hoặc hỏa táng (= thiêu)"
                },
                "examples": [
                    {
                        "en": "They found his body lying in the city morgue.",
                        "vi": "Họ tìm thấy xác anh nằm trong nhà xác thành phố."
                    },
                    {
                        "en": "This place is like a morgue!",
                        "vi": "Nơi này giống như một nhà xác!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where dead bodies that have been found are kept until they can be identified",
                    "vi": "nơi lưu giữ những xác chết được tìm thấy cho đến khi xác định được danh tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "89064deeeb224565b8a59273908d42ec",
        "word": "mortuary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːtʃəri/",
            "us": "/ˈmɔːrtʃueri/"
        },
        "nearby": [
            {
                "word": "mortise lock",
                "pos": "noun"
            },
            {
                "word": "'Jelly Roll' Morton",
                "pos": ""
            },
            {
                "word": "mortuary",
                "pos": "noun"
            },
            {
                "word": "mosaic",
                "pos": "noun"
            },
            {
                "word": "Moselle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or building, for example part of a hospital, in which dead bodies are kept before they are buried or cremated (= burned)",
                    "vi": "một căn phòng hoặc tòa nhà, ví dụ như một phần của bệnh viện, trong đó xác người chết được lưu giữ trước khi chôn cất hoặc hỏa táng (= thiêu)"
                },
                "examples": [
                    {
                        "en": "They put the body in the hospital mortuary.",
                        "vi": "Họ đưa thi thể vào nhà xác của bệnh viện."
                    },
                    {
                        "en": "He works at the public mortuary.",
                        "vi": "Anh ấy làm việc tại nhà xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where dead people are prepared for being buried or cremated (= burned) and where visitors can see the body",
                    "vi": "nơi người chết được chuẩn bị để chôn cất hoặc hỏa táng (= thiêu) và nơi du khách có thể nhìn thấy thi thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b09bb8a669754631ad5de8258fb8247a",
        "word": "parking garage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːkɪŋ ɡærɑːʒ/",
            "us": "/ˈpɑːrkɪŋ ɡərɑːʒ/"
        },
        "nearby": [
            {
                "word": "parking",
                "pos": "noun"
            },
            {
                "word": "parking brake",
                "pos": "noun"
            },
            {
                "word": "parking garage",
                "pos": "noun"
            },
            {
                "word": "parking lot",
                "pos": "noun"
            },
            {
                "word": "parking meter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building with several floors for parking cars in",
                    "vi": "một tòa nhà lớn với nhiều tầng để đậu xe ô tô trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "25602f5f2a3543159684d19885218b13",
        "word": "pavilion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pəˈvɪliən/",
            "us": "/pəˈvɪliən/"
        },
        "nearby": [
            {
                "word": "pavement",
                "pos": "noun"
            },
            {
                "word": "pavement artist",
                "pos": "noun"
            },
            {
                "word": "pavilion",
                "pos": "noun"
            },
            {
                "word": "paving",
                "pos": "noun"
            },
            {
                "word": "paving stone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a temporary building used at public events and exhibitions",
                    "vi": "một tòa nhà tạm thời được sử dụng tại các sự kiện và triển lãm công cộng"
                },
                "examples": [
                    {
                        "en": "the US pavilion at the Trade Fair",
                        "vi": "gian hàng của Hoa Kỳ tại Hội chợ Thương mại"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building next to a sports ground, used by players and people watching the game",
                    "vi": "một tòa nhà bên cạnh sân thể thao, được sử dụng bởi người chơi và những người xem trận đấu"
                },
                "examples": [
                    {
                        "en": "a cricket pavilion",
                        "vi": "một gian hàng cricket"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large building used for sports or entertainment",
                    "vi": "một tòa nhà lớn được sử dụng cho thể thao hoặc giải trí"
                },
                "examples": [
                    {
                        "en": "the Pauley Pavilion, home of the university’s basketball team",
                        "vi": "Pauley Pavilion, sân nhà của đội bóng rổ của trường đại học"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building that is meant to be more beautiful than useful, built as a shelter in a park or used for concerts and dances",
                    "vi": "một tòa nhà có nghĩa là đẹp hơn là hữu ích, được xây dựng làm nơi trú ẩn trong công viên hoặc được sử dụng cho các buổi hòa nhạc và khiêu vũ"
                },
                "examples": [
                    {
                        "en": "his first show at the Winter Gardens Pavilion, Blackpool",
                        "vi": "buổi trình diễn đầu tiên của anh ấy tại Winter Gardens Pavilion, Blackpool"
                    }
                ]
            }
        ]
    },
    {
        "id": "86ab7fdb5bff44a0bf084bd99186ed29",
        "word": "planetarium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌplænɪˈteəriəm/",
            "us": "/ˌplænɪˈteriəm/"
        },
        "nearby": [
            {
                "word": "planer",
                "pos": "noun"
            },
            {
                "word": "planet",
                "pos": "noun"
            },
            {
                "word": "planetarium",
                "pos": "noun"
            },
            {
                "word": "planetary",
                "pos": "adjective"
            },
            {
                "word": "Planet Hollywood",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building with a curved ceiling to represent the sky at night, with moving images of the planets and stars, used to educate and entertain people",
                    "vi": "một tòa nhà có trần cong để đại diện cho bầu trời vào ban đêm, với hình ảnh chuyển động của các hành tinh và các vì sao, được sử dụng để giáo dục và giải trí cho mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65f2ac0632694674bd7c8f82ce08ec59",
        "word": "public convenience",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpʌblɪk kənˈviːniəns/",
            "us": "/ˌpʌblɪk kənˈviːniəns/"
        },
        "nearby": [
            {
                "word": "public bill",
                "pos": "noun"
            },
            {
                "word": "public company",
                "pos": "noun"
            },
            {
                "word": "public convenience",
                "pos": "noun"
            },
            {
                "word": "public corporation",
                "pos": "noun"
            },
            {
                "word": "public defender",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public building containing toilets that are provided for anyone to use",
                    "vi": "một tòa nhà công cộng có nhà vệ sinh được cung cấp cho mọi người sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ccf12dbe978e48c7b053d45754466d3a",
        "word": "public house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpʌblɪk ˈhaʊs/",
            "us": "/ˌpʌblɪk ˈhaʊs/"
        },
        "nearby": [
            {
                "word": "public footpath",
                "pos": "noun"
            },
            {
                "word": "public holiday",
                "pos": "noun"
            },
            {
                "word": "public house",
                "pos": "noun"
            },
            {
                "word": "public housing",
                "pos": "noun"
            },
            {
                "word": "publicist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pub",
                    "vi": "một quán rượu"
                },
                "examples": [
                    {
                        "en": "The company owns over 300 public houses.",
                        "vi": "Công ty sở hữu hơn 300 căn nhà công cộng."
                    },
                    {
                        "en": "The new law applies to public houses and hotel premises.",
                        "vi": "Luật mới áp dụng cho nhà công cộng và cơ sở khách sạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "cc650a800ae248c58419a953e715dae9",
        "word": "shopping arcade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɒpɪŋ ɑːkeɪd/",
            "us": "/ˈʃɑːpɪŋ ɑːrkeɪd/"
        },
        "nearby": [
            {
                "word": "shopper",
                "pos": "noun"
            },
            {
                "word": "shopping",
                "pos": "noun"
            },
            {
                "word": "shopping arcade",
                "pos": "noun"
            },
            {
                "word": "shopping bag",
                "pos": "noun"
            },
            {
                "word": "shopping cart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building with a number of shops in it",
                    "vi": "một tòa nhà lớn với một số cửa hàng trong đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41babcab8bac4242ac7b0dd02350fefb",
        "word": "station house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪʃn haʊs/",
            "us": "/ˈsteɪʃn haʊs/"
        },
        "nearby": [
            {
                "word": "stationery",
                "pos": "noun"
            },
            {
                "word": "the Stationery Office",
                "pos": ""
            },
            {
                "word": "station house",
                "pos": "noun"
            },
            {
                "word": "stationmaster",
                "pos": "noun"
            },
            {
                "word": "Station of the Cross",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the office of a local police force",
                    "vi": "văn phòng của lực lượng cảnh sát địa phương"
                },
                "examples": [
                    {
                        "en": "The police led me into the station house.",
                        "vi": "Cảnh sát dẫn tôi vào nhà ga."
                    }
                ]
            }
        ]
    }
]